ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<ExchangePlan>
		<Properties>
			<Name>СинхронизацияДанныхЧерезУниверсальныйФормат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКМенеджеруОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат/Forms/ФормаУзла/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтаФорма);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементамФормы(Элементы.Организации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСкладамПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементамФормы(Элементы.Склады);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивВерсийФорматаОбмена = ОбменДаннымиПереопределяемый.ПолучитьВерсииУниверсальногоФорматаОбмена();
	Если МассивВерсийФорматаОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Версия Из МассивВерсийФорматаОбмена Цикл
		Элементы.ВерсияФорматаОбмена.СписокВыбора.Добавить(Версия);
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияФорматаОбмена) Тогда
		Объект.ВерсияФорматаОбмена = МассивВерсийФорматаОбмена[0];
	КонецЕсли;
	Если Объект.РазделыУчета.Количество() = 0 Тогда
		Объект.РазделыУчета.Загрузить(ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ПолучитьРазделыУчета(Ложь));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементамФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ

&НаКлиенте
Процедура УстановитьДоступностьЭлементамФормы(ТекущаяСтраница = Неопределено)
	
	ЗначенияФлаговИСтраниц = Новый Соответствие();
	ЗначенияФлаговИСтраниц.Вставить(Элементы.Организации, Объект.ИспользоватьОтборПоОрганизациям);
	ЗначенияФлаговИСтраниц.Вставить(Элементы.Склады, Объект.ИспользоватьОтборПоСкладам);
	
	СтраницыОтбора = Новый Массив();
	Если Объект.ИспользоватьОтборПоОрганизациям Тогда
		СтраницыОтбора.Добавить(Элементы.Организации);
	КонецЕсли;
	Если Объект.ИспользоватьОтборПоСкладам Тогда
		СтраницыОтбора.Добавить(Элементы.Склады);
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = Элементы.РазделыУчета;
	
	Элементы.Организации.Доступность = Объект.ИспользоватьОтборПоОрганизациям;
	Элементы.Склады.Доступность = Объект.ИспользоватьОтборПоСкладам;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОтправляемыхДанных(Команда)
	
	ОткрытьФорму("Обработка.РегистрацияИзмененийДляОбмена.Форма", ,, Объект.Ссылка);
	
КонецПроцедуры
